eis-cart-tests-master@3bc714a7387/tests/test-data/intf-specs/gswf/wsdls/synthetic-requests/DummySetUpOneToManyEvent/RaiseEventAsynchron.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:even="http://www.thegoldensource.com/EventRaiserService.wsdl">
   <soapenv:Header/>
   <soapenv:Body>
      <even:RaiseDummySetUpOneToManyEventAsynchron>
         <!--Optional:-->
         <even:JMSByteMessage>cid:388324790088</even:JMSByteMessage>
         <!--Optional:-->
         <even:JMSCorrelationID>?</even:JMSCorrelationID>
         <!--Optional:-->
         <even:JMSDestinationName>?</even:JMSDestinationName>
         <!--Optional:-->
         <even:JMSMessageID>?</even:JMSMessageID>
         <!--Optional:-->
         <even:JMSMessages>
            <!--You may enter ANY elements at this point-->
         </even:JMSMessages>
         <!--Optional:-->
         <even:JMSObjectMessage>?</even:JMSObjectMessage>
         <even:JMSProperties>
            <!--You may enter ANY elements at this point-->
         </even:JMSProperties>
         <!--Optional:-->
         <even:JMSTextMessage>?</even:JMSTextMessage>
         <!--Optional:-->
         <even:JMSTimestamp>?</even:JMSTimestamp>
         <!--Optional:-->
         <even:JMSType>?</even:JMSType>
         <!--Optional:-->
         <even:metadata>
            <!--You may enter ANY elements at this point-->
         </even:metadata>
      </even:RaiseDummySetUpOneToManyEventAsynchron>
   </soapenv:Body>
</soapenv:Envelope>